package com.job5156.jiangmen;

import com.job5156.util.StringUtil;
import com.job5156.util.Validator;

/**
 * @author wufalong
 * create on 2008-6-3
 */
public class MapTable
{
	public static void main(String[] args)
	{
		String str = "湖南广播电视大学(0410000){)";
		getAddressAndZip(str);
	}
	 public static String getCodeTwo(String value, String[][] array)
	 {
		if(Validator.isNull(value))return "";
	    try
	    {
	        for(int i=0;i<array.length;i++){
	            String[] div = (String[])(array[i]);
	            if(div[1].equalsIgnoreCase(value.trim())){
	                return div[0];
	            }
	        }
	    }
	    catch(Exception e)
	    {
	        e.printStackTrace();
	    }
	
	    return "";
	 }
	 
	 /***对地址和邮编处理 address,zipcode  湖南广播电视大学(410000)***/
	 public static String[] getAddressAndZip(String str)
	 {
		 String temp[] = {"",""};
		 if(!str.equals(""))
		 {
			 if(str.endsWith(")")&& str.lastIndexOf("(")==str.length()-8)
			 {
				 temp[0] = str.substring(0,str.lastIndexOf("("));
				 temp[1] = str.substring(str.lastIndexOf("(")+1,str.length()-1);
			 }else
			 {
				 temp[0] = str;
			 }
		 }
		 return temp;
	 }
	 
	 /**得到民族,如果为空就为汉族**/
	 public static String getNation(String str)
	 {
		 String temp = "";
		 if("".equals(str))
		 {
			 temp = "汉族";
		 }
		 else
		 {
			 temp = str;
		 }
		 return temp;
	 }
	 
	 public static String[][] sex = 
	 {
		 {"1","男"},
		 {"2","女"},
	 };
	 
	 public static String[][] marriage = 
	 {
		 {"0","未婚"},
		 {"1","已婚"},
		 {"2","离异"},
		 {"3","丧偶"},
	 };
	 
	 
	 public static String[][] highDegree = 
	 {
		{"1","初中"},
		{"2","高中"},
		{"3","中专"},
		{"4","大专"},
		{"5","本科"},
		{"6","硕士"},
		{"8","博士"},
	 };
	 
	 public static String[][] salary = 
	 {
		 {"0","面议"},
	 };
	 
	 public static String[][] englishLevel = 
	 {
		 {"4","一般"},
		 {"4","一般(二级)"},
		 {"4","二级"},
		 {"4","三级"},
		 {"3","四级"},
		 {"3","良好(四级)"},
		 {"3","良好"},
		 {"1","六级"},
		 {"1","优秀(六级)"},
		 {"1","熟练"},
		 {"2","六级以上"},
		 {"2","精通(八级)"},
		 {"2","精通"},
	 };
	 
	 public static String[][] otherEnglish = 
	 {
		 {"2400","其它外语"},
		 {"1100","日语"},
		 {"1400","俄语"},
		 {"1200","法语"},
		 {"1300","德语"},
		 {"1900","意大利语"},
		 {"1600","西班牙语"},
		 {"2400","朝鲜语"},
		 {"2400","蒙古语"},
		 {"1700","葡萄牙语"},
		 {"2400","越南语"},
		 {"2400","世界语"},
		 {"1800","阿拉伯语"},
		 {"2400","泰国语"},
		 {"2400","拉丁语"},
	 };
	 
	 public static String[][] addYear = 
	 {
		 {"3","初中"},
		 {"3","高中"},
		 {"2","中专"},
		 {"3","大专"},
		 {"4","本科"},
		 {"2","硕士"},
		 {"3","博士"},
	 };
	 
	 public static String[][] checkInDate = 
	 {
		 {"1","随时"},
		 {"2","一天"},
		 {"2","三天"},
		 {"3","一星期"},
		 {"4","二星期"},
		 {"4","一个月"},
	 };
	                        
	 public static String[][] jobLocation =
	 {
		 {"1400","广东"},
		 {"1403","广州市"},
		 {"1412","广东韶关市"},
		 {"1402","深圳市"},
		 {"1405","珠海市"},
		 {"1406","广东汕头市"},
		 {"1409","佛山市"},
		 {"1422","南海市"},
		 {"1408","江门市"},
		 {"1422","广东新会"},
		 {"1415","广东湛江市"},
		 {"1416","广东茂名市"},
		 {"1413","广东肇庆市"},
		 {"1407","广东惠州市"},
		 {"1417","广东梅州市"},
		 {"1418","广东汕尾市"},
		 {"1419","广东河源市"},
		 {"1410","广东阳江市"},
		 {"1411","广东清远市"},
		 {"1100","北京市"},
		 {"1000","天津市"},
		 {"1800","河北省"},
		 {"2600","山西省"},
		 {"3000","内蒙古"},
		 {"2100","辽宁省"},
		 {"2200","吉林"},
		 {"2000","黑龙江"},
		 {"1000","上海"},
		 {"1600","江苏"},
		 {"1500","浙江"},
		 {"2400","安徽"},
		 {"1700","福建"},
		 {"2900","江西"},
		 {"2500","山东"},
		 {"1900","河南"},
		 {"2700","湖北"},
		 {"2800","湖南"},
		 {"3100","广西"},
		 {"3603","海南省"},
		 {"3200","四川"},
		 {"3300","贵州"},
		 {"3400","云南"},
		 {"3900","西藏"},
		 {"2300","陕西"},
		 {"3500","甘肃"},
		 {"3600","青海"},
		 {"3700","宁夏"},
		 {"3800","新疆"},
	 };
	 
	 public static String[][] jobCode =
	 {
         {"1000","计算机类"},
         {"1009","信息系统分析员"},
         {"1004","软件开发与测试"},
         {"1016","系统维护/网络管理"},
         {"1006","网络工程"},
         {"1015","网站信息管理/内容编辑"},
         {"1014","网站策划"},
         {"1012","网页设计制作/网页美工"},
         {"2610","多媒体设计与开发"},
         {"2603","计算机辅助设计与绘图"},
         {"1003","数据库开发与管理"},
         {"1007","系统集成/技术支持"},
         {"1011","系统安全管理"},
         {"1300","电子/邮电/通讯类"},
         {"1406","电子/电器/电器维修"},
         {"1311","无线电技术"},
         {"1306","自动控制"},
         {"1407","综合布线/弱电"},
         {"1317","广播电视工程"},
         {"1302","通讯工程"},
         {"1312","电路设计/电子测试/半导体技术"},
         {"1310","单片机/DSP/底层软件开发"},
         {"1100","经营/管理/策划类"},
         {"1101","总裁/总经理/CEO"},
         {"1110","经理助理"},
         {"1111","厂长/副厂长"},
         {"1113","企业策划"},
         {"3102","企业管理/管理顾问"},
         {"1112","技术经理/项目经理/CTO"},
         {"1002","信息主管/CIO"},
         {"1700","市场销售/营销类"},
         {"1702","市场经理/营销管理"},
         {"1705","市场/行销策划"},
         {"1908","采购"},
         {"1704","市场调研/业务分析"},
         {"1207","医药代表"},
         {"2404","保险业务/经纪人"},
         {"1204","销售工程师"},
         {"1206","业务员/业务代表"},
         {"2400","金融/经济/贸易类"},
         {"2416","国内贸易"},
         {"1906","对外贸易"},
         {"2402","金融/投资分析"},
         {"2401","证券"},
         {"2416","外汇"},
         {"2403","期货经济"},
         {"2406","资产评估"},
         {"1907","报关员"},
         {"1909","船务"},
         {"2000","财务类"},
         {"2001","财务总监/经理/主任"},
         {"2011","财务"},
         {"2005","出纳/收银"},
         {"2010","统计"},
         {"2004","审计"},
         {"1600","工业/工厂类"},
         {"1618","生产管理"},
         {"1626","工程管理"},
         {"1604","品质管理"},
         {"1605","物料管理"},
         {"1607","设备管理"},
         {"1620","仓库管理"},
         {"1617","计划员/调度"},
         {"1623","化验员"},
         {"1619","跟单员"},
         {"3910","技工"},
         {"3901","钳工/机修工/钣金工"},
         {"3902","电焊工/铆焊工"},
         {"3903","车工/磨床/铣工/冲床/锣床/车床"},
         {"3904","模具工"},
         {"3905","水工/木工/油漆工"},
         {"3906","电工"},
         {"3907","空调工/电梯工/锅炉工"},
         {"3908","叉车工"},
         {"3909","裁剪车缝熨烫"},
         {"3911","普通工人"},
         {"1500","机械/设备维修类"},
         {"1519","塑性加工/铸造/焊接/切割"},
         {"1518","精密机械/精密仪器/仪器仪表"},
         {"1501","机械设计/制造"},
         {"1505","机电一体化"},
         {"1521","机床"},
         {"1517","液压传动"},
         {"1505","机械自动化/工业自动化"},
         {"1512","船舶工程"},
         {"1513","锅炉/压力容器"},
         {"1521","设备安装"},
         {"1516","金属制品"},
         {"1503","模具设计/制造与维修"},
         {"1521","传感器"},
         {"1521","检测技术及仪器/计量测试"},
         {"1511","机械设备与汽车、摩托维修"},
         {"3300","动力电气类"},
         {"3303","电力维修/电力拖动"},
         {"3303","发配电工程/电力管理"},
         {"3308","内燃机及热能动力"},
         {"1408","光源与照明工程"},
         {"3304","制冷/制冷设备"},
         {"1401","电气/工业电气化"},
         {"2300","文职类"},
         {"2101","英语翻译"},
         {"2102","日语翻译"},
         {"2110","俄、德、法、意等其它外语翻译"},
         {"2308","公关"},
         {"2307","文档管理"},
         {"2301","文秘/文员"},
         {"2304","电脑操作员/打字员"},
         {"3200","文教法律类"},
         {"3501","记者/新闻采编/新闻摄影"},
         {"3504","编辑"},
         {"3413","广播电影电视艺术"},
         {"3401","节目主持/DJ/播音"},
         {"3411","化妆/美容师"},
         {"3204","高等教育"},
         {"3204","中等教育"},
         {"3206","小学/幼儿教育"},
         {"3208","职业教育/培训/家教"},
         {"3213","体育类"},
         {"2801","律师/法律顾问"},
         {"2600","设计/广告类"},
         {"1714","广告设计/策划"},
         {"1715","文案策划/媒体策划"},
         {"1716","广告制作/平面设计与制作"},
         {"2603","美术/图形设计"},
         {"2611","工业设计/产品设计"},
         {"2501","服装设计"},
         {"2606","家具设计"},
         {"2607","珠宝设计"},
         {"2606","玩具设计"},
         {"2614","电脑绘图"},
         {"2601","产品包装设计"},
         {"2612","形象设计"},
         {"1800","行政/人事类"},
         {"1801","行政/人力资源经理"},
         {"1802","行政/人事"},
         {"2200","房地产/土建类"},
         {"2206","房地产"},
         {"2202","建筑设计/结构设计"},
         {"2208","工程预决算"},
         {"2219","工民建"},
         {"2214","给排水/水电工程"},
         {"2214","暖通/空调"},
         {"2210","物业管理"},
         {"2215","路桥工程"},
         {"2222","建筑材料与制品"},
         {"2212","室内装潢/设计"},
         {"2203","绘图/建筑制图"},
         {"2205","工程监理"},
         {"2213","水电管理"},
         {"2213","管道"},
         {"2209","建筑施工管理"},
         {"2221","基础地下工程/岩土工程"},
         {"2216","港口与航道工程"},
         {"3800","服务/后勤类"},
         {"3617","客户服务经理/副经理"},
         {"3601","宾馆酒店管理"},
         {"3611","饮食娱乐管理"},
         {"3609","导游"},
         {"3801","保安"},
         {"3802","司机"},
         {"3804","寻呼服务"},
         {"3805","社区服务"},
         {"3706","服务员"},
         {"3706","营业员/店务"},
         {"3807","厨师"},
         {"1213","技术支持/客户培训"},
         {"3615","前台/接待/礼仪"},
         {"4000","交通运输（海陆空）类"},
         {"2700","化学工程类"},
         {"2707","无机化工"},
         {"2708","有机化工"},
         {"2703","精细化工"},
         {"2710","分析化工"},
         {"2704","高分子化工"},
         {"2706","电镀化工"},
         {"2702","生物化工/制药工程"},
         {"2711","废品处理"},
         {"2705","化学药剂/农药/化肥"},
         {"1506","塑胶/注塑"},
         {"2712","玻璃工艺/化工工艺"},
         {"2900","轻工类"},
         {"1512","纺织/化纤"},
         {"2901","染整技术"},
         {"2902","纸浆造纸工艺"},
         {"2901","印刷"},
         {"2510","制鞋/制衣/制革"},
         {"2903","食品工程/糖酒"},
         {"5124","包装工程"},
         {"5205","陶瓷技术"},
         {"2905","金银首饰加工"},
         {"3000","医药/美容保健类"},
         {"3003","外科"},
         {"3003","内科"},
         {"3018","骨科"},
         {"3018","放射科"},
         {"3018","脑科"},
         {"3018","口腔科"},
         {"3018","五官科"},
         {"3018","皮肤科"},
         {"3001","西医"},
         {"3001","中医"},
         {"3001","医疗"},
         {"3015","麻醉"},
         {"3008","药剂/中药/西药"},
         {"3001","中西医"},
         {"3006","心理医生"},
         {"3007","护士、护理"},
         {"3009","针灸推拿"},
         {"3010","临床医学"},
         {"3011","妇幼保健"},
         {"3012","卫生防疫"},
         {"3013","医学检验"},
         {"3014","兽医/宠物医生"},
         {"4000","理科类"},
         {"3300","能源水利类"},
         {"4002","生物工程类"},
         {"4006","地矿冶金类"},
         {"4003","测绘技术类"},
         {"4010","喷涂/金属材料类"},
         {"4007","环境保护类"},
         {"2217","园林/园艺类"},
         {"4009","农林渔牧类"},
         {"4000","其它类"},
	 };
}
