package com.job5156.ningbo;

import com.job5156.util.Validator;
public class MapTable
{
	public static void main(String[] args){
//		String str = "湖南广播电视大学(0410000){)";
//		getAddressAndZip(str);
	}
	 public static String getCodeTwo(String value,String [][] array){
		if(Validator.isNull(value))
			return "";
		try{
			for(int i = 0;i < array.length;i ++ ){
				String [] div = (String [])(array[i]);
				if(div[1].equalsIgnoreCase(value.trim())){
					return div[0];
				}
			}
		}
		catch(Exception e){
			e.printStackTrace();
		}

		return "";
	}
	 
	 /** *对地址和邮编处理 address,zipcode ** */
	 public static String [] getAddressAndZip(String str){
		String temp[] = { "", "" };
		if( ! str.equals("")){
			if(str.endsWith(")") && str.lastIndexOf("(") == str.length() - 8){
				temp[0] = str.substring(0,str.lastIndexOf("("));
				temp[1] = str.substring(str.lastIndexOf("(") + 1,str.length() - 1);
			}
			else{
				temp[0] = str;
			}
		}
		return temp;
	}
	 
	 
	 /** 得到民族,如果为空就为汉族* */
	 public static String getNation(String str){
		String temp = "";
		if("".equals(str)){
			temp = "汉族";
		}
		else{
			temp = str;
		}
		return temp;
	}
	 
	 public static String[][] sex = 
	 {
		 {"1","男"},
		 {"2","女"},
	 };
	 
	 public static String[][] marriage = 
	 {
		 {"3","丧偶"},
		 {"3","不祥"},
		 {"1","已婚"},
		 {"0","未婚"},
		 {"2","离异"},
		 
		 
	 };
	 
	 
	 public static String[][] highDegree = 
	 {
		{"0",""},
		{"1","初中"},
		{"2","高中"},
		{"3","中专"},
		{"4","大专"},
		{"5","本科"},
		{"6","硕士"},
		{"8","博士"},
		{"0","博士后"},
	 };
	 
	 public static String[][] salary = 
	 {
		 {"0","面议"},
	 };
	 
	 public static String[][] languageLever= 
	 {
		 {"4","一般"},
		 {"4","二级"},
		 {"4","2级"},
		 {"4","三级"},
		 {"4","3级"},
		 {"1001","四级"},
		 {"1001","4级"},
		 {"1001","CET4"},
		 {"1001","cet4"},
		 {"1002","CET6"},
		 {"1002","cet6"},
		 {"1001","CET-4"},
		 {"1001","cet-4"},
		 {"1002","CET-6"},
		 {"1002","cet-6"},
		 {"3","良好"},
		 {"3","较好"},
		 {"3","好"},
		 {"1","六级"},
		 {"1","优秀(六级)"},
		 {"1","熟练"},
		 {"1002","六级"},
		 {"1004","八级"},
		 {"2","精通"},
	 };
	 
	 public static int getLanguageLever(String lang){
		 int lev=4;
		 if(!"".equals(lang)){
			 int len=languageLever.length;
			 for(int i=0;i<len;i++){
				 if(lang.indexOf(languageLever[i][1])!=-1){
					 lev=Integer.parseInt(languageLever[i][0]);
					 break;
				 }
			 }
		 }
		 return lev;
	 }
	 
	 public static String[][] languageType = 
	 {
		 {"1000","英语"},
		 {"2400","其它外语"},
		 {"1100","日语"},
		 {"1400","俄语"},
		 {"1200","法语"},
		 {"1300","德语"},
		 {"1900","意大利语"},
		 {"1600","西班牙语"},
		 {"2400","朝鲜语"},
		 {"2400","蒙古语"},
		 {"1700","葡萄牙语"},
		 {"2400","越南语"},
		 {"2400","世界语"},
		 {"1800","阿拉伯语"},
		 {"2400","泰国语"},
		 {"2400","拉丁语"},
	 };
	 	 
	 public static String[][] addYear = 
	 {
		 {"3","初中"},
		 {"3","高中"},
		 {"2","中专"},
		 {"3","大专"},
		 {"4","本科"},
		 {"2","硕士"},
		 {"3","博士"},
	 };
	 
	 public static String[][] checkInDate = 
	 {
		 {"1","随时"},
		 {"2","一天"},
		 {"2","三天"},
		 {"3","一星期"},
		 {"4","二星期"},
		 {"4","一个月"},
	 };
	                        
	 public static String[][] jobLocation =
	 {
		 {"1100","北京市"},
		 {"1200","天津市"},
		 {"1800","河北省"},
		 {"2600","山西省"},
		 {"3000","内蒙古自治区"},
		 {"2100","辽宁省"},
		 {"2200","吉林省"},
		 {"2000","黑龙江省"},
		 {"1000","上海市"},
		 {"1600","江苏省"},
		 {"1500","浙江省"},
		 {"1501","杭州市"},
		 {"1502","宁波市"},
		 {"1502","海曙区"},
		 {"1502","江东区"},
		 {"1502","江北区"},
		 {"1502","北仑区"},
		 {"1502","高新区"},
		 {"1502","保税区"},
		 {"1502","大榭开发区"},
		 {"1502","东钱湖旅游度假区"},
		 {"1502","镇海区"},
		 {"1502","象山县"},
		 {"1502","宁海县"},
		 {"1502","鄞州区"},
		 {"1500","余姚市"},
		 {"1500","慈溪市"},
		 {"1500","奉化市"},
		 {"1503","温州市"},
		 {"1507","嘉兴市"},
		 {"1506","湖州市"},
		 {"1505","绍兴市"},
		 {"1504","金华市"},
		 {"1508","衢州市"},
		 {"1511","舟山市"},
		 {"1510","台州市"},
		 {"2400","安徽省"},
		 {"1700","福建省"},
		 {"2900","江西省"},
		 {"2500","山东省"},
		 {"1900","河南省"},
		 {"2700","湖北省"},
		 {"2800","湖南省"},
		 {"1400","广东省"},
		 {"3100","广西壮族自治区"},
		 {"3603","海南省"},
		 {"1300","重庆市"},
		 {"3200","四川省"},
		 {"3300","贵州省"},
		 {"3400","云南省"},
		 {"3900","西藏自治区"},
		 {"2300","陕西省"},
		 {"3500","甘肃省"},
		 {"3600","青海省"},
		 {"3700","宁夏回族自治区"},
		 {"3800","新疆维吾尔自治区"},
		 {"4300","台湾省"},
		 {"4100","香港特别行政区"},
		 {"4500","境外"},
	 };
	
	 /**
	  * 宁波人才网的职位类别
	  * 第一维：job5156的职位编码
	  * 第二维：宁波人才网职位类别名称
	  * 第三维：job5156职位名称
	  * 
	  */
	 public static String[][] jobCode =
	 {
         {"1700","市场营销/公关","营销/企划/媒介/公关类"},
         {"1715","市场经理/营销管理","市场/营销经理"},
         {"1708","市场/行销策划","市场/行销企划"},
         {"1799","采购","采购专员/助理"},
         {"1707","市场调研/业务分析","市场调研/业务分析员"},
         {"1700","医药代表/医药器械销售","医药代表"},
         {"1799","报销业务/经纪人","营销/企划/媒介/公关类-其它"},
         {"1799","销售工程师","营销/企划/媒介/公关类-其它"},
         {"1503","业务员/促销员","业务员"},
         {"1602","售前/售后支持","售前/售后服务/技术支持"},
         {"1703","公关经理/主管","公关经理"},
         {"1410","商务代表","商务经理"},
         {"2400","产品/生产","工业/工厂类"},
         {"2424","生产管理","生产经理/主管"},
         {"2501","品质管理","质量管理/测试"},
         {"4104","物料管理","物料主管/专员"},
         {"2423","设备管理","设备经理/主管"},
         {"4212","仓库管理","仓库管理员"},
         {"2403","计划员/调度","计划员/调度员"},
         {"2504","质检员","质量管理/验货员（QA/QC）"},
         {"2516","安全管理","安全主任"},
         {"3840","跟单员","跟单员"},
         {"4200","商业/贸易/物流","贸易/采购/物流类"},
         {"4222","对外贸易","外贸专员/助理"},
         {"4223","国内贸易","国内贸易人员"},
         {"4227","船务人员","船务人员"},
         {"4226","报关员","报关员"},
         {"4202","物流管理","物流专员/助理"},
         {"4201","物流操作员","物流操作员"},
         {"4299","店面管理","贸易/采购/物流类-其它"},
         {"4206","快递员","快递员"},
         {"4205","单证","单证员"},
         {"2200","管理/行政/人事/文秘","人力资源/行政类"},
         {"1801","总裁/总经理/CEO","（正/副）总裁/总经理/CEO"},
         {"1809","经理助理","经理助理"},
         {"1810","厂长/副厂长","厂长/副厂长"},
         {"1913","企业策划管理","企业策划/顾问"},
         {"1111","技术经理/项目经理/CTO","技术总监CTO"},
         {"1807","部门经理","部门经理/主管"},
         {"2208","行政总监","行政总监"},
         {"2210","行政助理","行政助理/文员"},
         {"2204","人事经理","人事经理/主管/专员"},
         {"2204","人事专员","人事经理/主管/专员"},
         {"2213","办公室主任","办公室主任"},
         {"2302","秘书","秘书/高级秘书"},
         {"2305","文员","文员/高级文员"},
         {"2299","文档管理","人力资源/行政类-其它"},
         {"2306","电脑操作","电脑操作员/打字员"},
         {"2100","金融/财务/审计/统计"},
         {"2110","金融/投资分析","金融投资分析员"},
         {"2105","证券","证券经纪人"},
         {"2124","外汇","外汇交易专员"},
         {"2106","期货经济","证券期货从业人员"},
         {"2101","资产评估","评估/分析师"},
         {"2125","银行职员","出纳员/银行专员"},
         {"2018","财务总监/经理","首席财务官CFO/财务总监"},
         {"2005","会计","会计/会计助理"},
         {"2013","审计","审计专员/助理"},
         {"2003","统计","统计员"},
         {"2002","出纳/收银","出纳员"},
         {"1000","计算机/互联网/通讯","计算机开发/应用类"},
         {"1005","信息系统分析员","系统分析师/系统分析员"},
         {"1015","软件开发与测试","软件工程师"},
         {"1006","系统维护/网络管理","系统维护员"},
         {"1105","系统集成","系统集成/技术支持"},
         {"1105","技术支持工程师","系统集成/技术支持"},
         {"1021","网站信息管理/内容编辑","网站编辑员"},
         {"1019","网页设计/网页美工","网页设计师"},
         {"1011","多媒体设计与开发","多媒体/游戏开发工程师"},
         {"1013","计算机辅助设计与绘图","计算机辅助设计工程师"},
         {"1003","数据库开发与管理","数据库开发与管理（DBA）"},
         {"1002","系统安全管理","网络信息安全工程师"},
         {"1012","电子商务","INTERNET/WEB/电子商务师"},
         {"1204","有线通信","有线传输工程师"},
         {"1205","无线通信","无线通信工程师"},
         {"3199","广播电视工程"},
         {"1299","其他通信","通讯类-其它"},
         {"1300","电子/电器","电子/电器（气）类"},
         {"1301","电子工程","电子工程师/技术员"},
         {"1309","无线电技术","无线电技术员"},
         {"1314","电子元器件","电子元器件工程师"},
         {"1317","单片机/底层软件开发","嵌入式/底层软件开发（Linux/单片机/DSP/...）"},
         {"1306","电路设计/电子测试","电路（布线）设计工程师"},
         {"1307","弱电工程技术","智能大厦/综合布线/弱电"},
         {"1300","电子/电器维修","电子/电器（气）类"},
         {"1308","自动控制","自动控制技术员"},
         {"2600","五金/机械","机械（电）/仪表类"},
         {"2605","机械设计/制造","机械设计/制造工程师"},
         {"2616","机电一体化","机电一体化"},
         {"2699","机床","机械（电）/仪表类-其它"},
         {"2615","液压传动","气动/液压"},
         {"2699","机械自动化/工业自动化","机械（电）/仪表类-其它"},
         {"2607","船舶工程","船舶机械工程师"},
         {"2619","锅炉/压力容器","锅炉/压力容器"},
         {"2620","设备安装","设备修理"},
         {"2622","金属制品","五金矿产/金属制品"},
         {"3022","模具设计/制造与维修","模具设计"},
         {"2699","传感器","机械（电）/仪表类-其它"},
         {"2699","检测技术仪器/计量测试","机械（电）/仪表类-其它"},
         {"2613","机械设备与汽车、摩托车","汽车/摩托车工程师"},
         {"2611","精密机械/仪器仪表","精密机械/仪器仪表工程师"},
         {"2617","塑性加工/铸造/焊接","铸造/锻造工程师"},
         {"2601","机械制图","机械制图员"},
         {"2900","建筑","建筑/施工/园林（园艺）类"},
         {"2925","城市规划/市政工程","城市规划与设计"},
         {"2907","工业与民用建筑","工民建"},
         {"2903","建筑设计/结构设计","建筑（结构）设计工程师"},
         {"2910","工程预决算","建筑工程造价/预结算师"},
         {"2917","给排水技术","给排水/供水（电）工程师"},
         {"2916","水电技术","管道（水、电）"},
         {"2918","暖通/空调","制冷暖通"},
         {"2914","工程监理","工程监理"},
         {"2928","建筑施工管理","建筑施工管理"},
         {"2912","路桥工程","路桥技术/隧道工程"},
         {"2999","建筑材料/制品","建筑/施工/园林（园艺）类-其它"},
         {"3004","室内装潢/设计","室内（外）装修/装潢设计"},
         {"2904","绘图/建筑制图","建筑制图工程师"},
         {"9905","工程测量测绘","测绘技术"},
         {"2913","基础地下工程/岩土工程","基建/岩土工程"},
         {"2919","港口与航运工程","港口与航道工程"},
         {"2922","园林/园艺","园艺/园林设计"},
         {"2800","房地产","房地产/物业类"},
         {"2802","楼盘销售","房地产销售"},
         {"2808","房地产评估师","房地产评估师"},
         {"2804","物业管理","物业管理"},
         {"2806","项目策划/项目销售","房地产开发/策划经理"},
         {"2899","置业顾问","房地产/物业类-其它"},
         {"2899","陶瓷技术","房地产/物业类-其它"},
         {"3400","化工/塑胶","化工/制药/医疗器械类"},
         {"3410","无机化工","无机化工/有机化工"},
         {"3410","有机化工","无机化工/有机化工"},
         {"3412","精细化工","精细化工/分析化工/电镀化工"},
         {"3412","分析化工","精细化工/分析化工/电镀化工"},
         {"3411","高分子化工","高分子化工/化纤/新材料"},
         {"3412","电镀化工","精细化工/分析化工/电镀化工"},
         {"3405","生物化工/制药工程","生物化工"},
         {"3406","废品处理","造纸/废品处理"},
         {"3413","化学药剂/农药化肥","化学药剂/药品"},
         {"2702","塑胶/注塑","塑胶模师傅/普师/补师"},
         {"3499","玻璃工艺/化工工艺","化工/制药/医疗器械类-其它"},
         {"4100","轻工/纺织","轻工/陶瓷类"},
         {"3014","纺织/化纤","纺织/服饰（装）设计"},
         {"3804","染整技术","染整工程师"},
         {"3722","制浆造纸工艺","制浆造纸工程师"},
         {"4105","印刷","印刷/染整技术员"},
         {"4108","制鞋/制衣/制革","制鞋/制衣/制革/手袋"},
         {"4114","食品工程/糖酒","食品工程/糖酒饮料/粮油副食"},
         {"3701","包装工程","包装工程师"},
         {"4115","金银首饰加工","金银首饰加工"},
         {"3599","动力电器","能源动力类-其它"},
         {"3503","电力维修/电力拖动","电厂/电力"},
         {"3503","发配电工程/电力管理","电厂/电力"},
         {"3599","内燃机及热能动力","能源动力类-其它"},
         {"1318","光源与照明工程","光源与照明工程"},
         {"3504","制冷/制冷设备","制冷/暖通"},
         {"3599","电气/工业电气化","能源动力类-其它"},
         {"3000","广告/设计/媒体","设计类"},
         {"3002","广告策划","广告设计/创意策划师"},
         {"3002","广告设计","广告设计/创意策划师"},
         {"3099","广告业务","设计类-其它"},
         {"3017","平面设计","形象设计/平面设计"},
         {"3012","工业/产品设计","工业产品设计"},
         {"3010","产品包装设计","产品包装设计"},
         {"3007","动画设计","三维动画设计"},
         {"3801","服装设计","服装设计师"},
         {"3016","家具设计","家具设计"},
         {"3019","珠宝设计","珠宝设计/首饰设计"},
         {"3018","玩具设计","玩具设计"},
         {"3111","新闻采编/记者","记者"},
         {"4411","编辑","编辑"},
         {"3108","主持人/播音员/DJ","节目主持人"},
         {"3101","影视策划/制作人员","影视策划/制作人员"},
         {"3106","摄影/美术","摄影师/摄影助理"},
         {"3314","戏剧舞蹈","瑜伽/舞蹈老师/瘦身顾问"},
         {"3103","化妆/美容师","化妆/造型师"},
         {"1900","法律/文教/翻译","法律/咨询（顾问）类"},
         {"1901","律师","律师"},
         {"1902","法律顾问","法律顾问"},
         {"1903","法务人员","法务人员"},
         {"3205","高等教育","高等教育"},
         {"3206","中等教育","中级教育"},
         {"3208","小学教育","小学/幼儿教育"},
         {"3208","幼儿教育","小学/幼儿教育"},
         {"3299","音乐教师","文体教育/培训类-其它"},
         {"3299","舞蹈教师","文体教育/培训类-其它"},
         {"3212","职业教育/培训/家教","职业教育/培训"},
         {"4501","英语翻译","英语翻译"},
         {"4502","日语翻译","日语翻译"},
         {"4503","法语翻译","法语翻译"},
         {"4504","德语翻译","德语翻译"},
         {"4505","俄语翻译","俄语翻译"},
         {"4599","其他外语翻译","翻译语言类-其它"},
         {"3300","卫生/体育","卫生医疗/保健护理（美容）类"},
         {"3301","西医","医生/医师/理疗师"},
         {"3301","中医","医生/医师/理疗师"},
         {"3306","药剂师","药剂/中药/西药/药检师"},
         {"3302","心理医生","牙科/心理/外科/内科/预防/妇产科医生"},
         {"3304","针灸推拿","针灸推拿/妇幼保健/卫生防疫"},
         {"3305","临床医学","临床医学/研究员/协调员"},
         {"3304","妇幼保健","针灸推拿/妇幼保健/卫生防疫"},
         {"3304","卫生防疫","针灸推拿/妇幼保健/卫生防疫"},
         {"3421","医/药检验","医药检验"},
         {"3303","护士、护理","护士/护理员"},
         {"3417","医疗技术人员","医药技术研发管理人员"},
         {"3308","兽医/宠物医生","兽医"},
         {"3313","教练员","健身教练/顾问"},
         {"3399","运动员","卫生医疗/保健护理（美容）类-其它"},
         {"3600","旅游酒店","酒店宾馆/餐饮旅游类"},
         {"3602","大堂经理","大堂经理/副理"},
         {"3699","酒店市场拓展","酒店宾馆/餐饮旅游类-其它"},
         {"3613","导游","导游"},
         {"3604","酒店管理","酒店管理"},
         {"3612","餐饮管理","娱乐/餐饮管理员"},
         {"3608","厨师/厨师长","高级厨师"},
         {"3619","服务员","部长/领班/服务员"},
         {"4000","技工","技工/普工类"},
         {"4006","钳工/钣金工","钳工"},
         {"4099","机修工","技工/普工类-其它"},
         {"4003","电焊工","焊工"},
         {"4005","铆焊工","铣、刨、钣、铆、冲、铸"},
         {"4016","模具工","模具工"},
         {"4002","电工","电工"},
         {"2621","电镀技术","电镀/热处理"},
         {"4010","空调工","空调工/锅炉工/电梯工"},
         {"4004","车床工","车床工"},
         {"4001","叉车工","叉车司机"},
         {"4099","喷油工","技工/普工类-其它"},
         {"4099","普工","技工/普工类-其它"},
         {"4303","司机","司机"},
         {"4302","保安","保安"},
         {"4300","服务/后勤","后勤保障类"},
         {"1601","客户服务","客户服务"},
         {"4310","寻呼服务","寻呼/声讯"},
         {"4305","社区服务","社区服务"},
         {"3901","营业员/导购","营业员/服务员/店员"},
         {"3606","前台/接待/礼仪","咨客/前台接待/礼仪/接线生"},
         {"3611","调音调酒","调酒师/茶艺师"},
         {"4399","后勤管理","后勤保障类-其它"},
         {"9999","其他类","其它岗位类-其它"},
         {"9999","理科类","其它岗位类-其它"},
         {"3599","能源水利","能源动力类-其它"},
         {"9908","地矿冶金","矿产治金"},
         {"9904","生物工程","生物技术"},
         {"9909","环境保护","环境工程"},
         {"9910","农林牧渔","农、林、牧、渔"},
         {"9902","交通运输","交通运输"},
         {"9999","金属材料","其它岗位类-其它"},
         {"9905","测汽技术","测绘技术"},
         {"3417","医药技术","医药技术研发管理人员"},
         {"1910","猎头顾问/猎头","高级猎头顾问"},
	 };
}
